#+STARTUP: overview
* Keyboard mappings
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<f12>") 'package-refresh-contents)
(global-set-key (kbd  "<f5>") 'revert-buffer)
(global-set-key (kbd "C-x p") 'find-file-at-point)
(global-set-key [(meta shift-up)] 'move-line-up)
(global-set-key [(meta shift-down)] 'move-line-down)
(global-set-key (kbd "C-c d") (lambda () (interactive) (insert "(/)")))
(global-set-key (kbd "C-c i") (lambda () (interactive) (insert "(on)")))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (insert (on)) |



